## Terraform Summary

| Step                         | Result  |
|:-----------------------------|:-------:|
| 🖌  Terraform Format & Style | ✅ |
| ⚙️  Terraform Initialization  | ✅ |
| 🤖  Terraform Validation     | ✅ |
| 📖  Terraform Plan           | ✅ |

_**Hint:** If "Terraform Format & Style" failed, run `terraform fmt -recursive` from the `terraform/` directory and commit the results._

### Output

<details>
<summary>Validation Output</summary>

```
Success! The configuration is valid.


```

</details>

<details>
<summary>Plan Output</summary>

```diff

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create
  ~ update in-place
-   destroy
-/+ destroy and then create replacement
+/- create replacement and then destroy

Terraform will perform the following actions:

  # aws_ecs_service.console will be updated in-place
  ~ resource "aws_ecs_service" "console" {
        id                                 = "arn:aws:ecs:us-west-2:357150818708:service/cpfreporter/cpfreporter-console"
        name                               = "cpfreporter-console"
        tags                               = {}
      ~ task_definition                    = "arn:aws:ecs:us-west-2:357150818708:task-definition/cpfreporter-console:120" -> (known after apply)
        # (15 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # aws_ecs_task_definition.console must be replaced
+/- resource "aws_ecs_task_definition" "console" {
      ~ arn                      = "arn:aws:ecs:us-west-2:357150818708:task-definition/cpfreporter-console:120" -> (known after apply)
      ~ arn_without_revision     = "arn:aws:ecs:us-west-2:357150818708:task-definition/cpfreporter-console" -> (known after apply)
      ~ container_definitions    = jsonencode(
          ~ [
              ~ {
                  ~ image                  = "ghcr.io/usdigitalresponse/cpf-reporter-console@sha256:21c897aebb23b4b248f10f795476ce5eb97a09ed0879a95908c773d1be02c718" -> "ghcr.io/usdigitalresponse/cpf-reporter-console@sha256:3f05210595ee99f3151064deffadd265e4e612bb24412bcbc3bdaaf4da0f7f32"
-                   mountPoints            = []
                    name                   = "console"
-                   portMappings           = []
-                   systemControls         = []
-                   volumesFrom            = []
                    # (7 unchanged attributes hidden)
                },
            ] # forces replacement
        )
      ~ id                       = "cpfreporter-console" -> (known after apply)
      ~ revision                 = 120 -> (known after apply)
-       tags                     = {} -> null
        # (10 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # aws_s3_object.lambda_artifact-graphql will be updated in-place
  ~ resource "aws_s3_object" "lambda_artifact-graphql" {
      ~ etag                   = "aa58d7f2c1123b3ad7048bce2dd4c377-6" -> "9aec4e89c018919741d557f4baa1d761"
        id                     = "graphql.9aec4e89c018919741d557f4baa1d761.zip"
        tags                   = {}
      ~ version_id             = "OOUzrtQ55nyFdRjRQYLkd8bSbTItOK6E" -> (known after apply)
        # (12 unchanged attributes hidden)
    }

  # aws_s3_object.lambda_artifact-processValidationJson will be updated in-place
  ~ resource "aws_s3_object" "lambda_artifact-processValidationJson" {
      ~ etag                   = "ada4a30aba929324eb23ead6dd3883bf-5" -> "49f6291dc84bb27b95f10c7de8148425"
        id                     = "processValidationJson.49f6291dc84bb27b95f10c7de8148425.zip"
        tags                   = {}
      ~ version_id             = "4889MyTvCUkBYxkxZJtkuMIx50nOcCp0" -> (known after apply)
        # (12 unchanged attributes hidden)
    }

  # aws_s3_object.lambda_artifact-python must be replaced
-/+ resource "aws_s3_object" "lambda_artifact-python" {
+       acl                    = (known after apply)
      ~ arn                    = "arn:aws:s3:::cpfreporter-lambdaartifacts-357150818708-us-west-2/python.b5970b3445417c305b7223364c478cbb.zip" -> (known after apply)
      ~ bucket_key_enabled     = false -> (known after apply)
+       checksum_crc32         = (known after apply)
+       checksum_crc32c        = (known after apply)
+       checksum_sha1          = (known after apply)
+       checksum_sha256        = (known after apply)
      ~ content_type           = "binary/octet-stream" -> (known after apply)
      ~ etag                   = "e743c0a70cb6c10ba2ffff0b73347625-4" -> "df5d642dfb16a6701056fdf5dc795624"
      ~ id                     = "python.b5970b3445417c305b7223364c478cbb.zip" -> (known after apply)
      ~ key                    = "python.b5970b3445417c305b7223364c478cbb.zip" -> "python.df5d642dfb16a6701056fdf5dc795624.zip" # forces replacement
+       kms_key_id             = (known after apply)
-       metadata               = {} -> null
      ~ source_hash            = "b5970b3445417c305b7223364c478cbb" -> "df5d642dfb16a6701056fdf5dc795624"
      ~ storage_class          = "STANDARD" -> (known after apply)
-       tags                   = {} -> null
      ~ version_id             = "gO27ZttgZRWk5whGwHWjcR8ITwroLFyh" -> (known after apply)
        # (5 unchanged attributes hidden)
    }

  # aws_s3_object.origin_dist_artifact["200.html"] will be updated in-place
  ~ resource "aws_s3_object" "origin_dist_artifact" {
      ~ etag                   = "8676bbc67bd97392166276f4bff1f0f2" -> "81d5cc6cfe2b776f1f7badadd8c99ef8"
        id                     = "dist/200.html"
      ~ source_hash            = "8676bbc67bd97392166276f4bff1f0f2" -> "81d5cc6cfe2b776f1f7badadd8c99ef8"
        tags                   = {}
      ~ version_id             = "P.VgfnGEmXuiAkSXkseiAwdWOmwS5TPf" -> (known after apply)
        # (11 unchanged attributes hidden)
    }

  # aws_s3_object.origin_dist_artifact["build-manifest.json"] will be updated in-place
  ~ resource "aws_s3_object" "origin_dist_artifact" {
      ~ etag                   = "264c00df5249c4f94fd35410aaaff481" -> "74ea080761e66561b33efaeca653a23a"
        id                     = "dist/build-manifest.json"
      ~ source_hash            = "264c00df5249c4f94fd35410aaaff481" -> "74ea080761e66561b33efaeca653a23a"
        tags                   = {}
      ~ version_id             = "bqerwHDL07Qco0S2ZFiMR78WSCWh90C3" -> (known after apply)
        # (11 unchanged attributes hidden)
    }

  # aws_s3_object.origin_dist_artifact["chunk-references.json"] will be updated in-place
  ~ resource "aws_s3_object" "origin_dist_artifact" {
      ~ etag                   = "16ac02854479be8660cefac10f620c70" -> "9be261ba1fd32a272a3e048079164d7f"
        id                     = "dist/chunk-references.json"
      ~ source_hash            = "16ac02854479be8660cefac10f620c70" -> "9be261ba1fd32a272a3e048079164d7f"
        tags                   = {}
      ~ version_id             = "X58ZVKDdO6N.m.iBEUeMmtnw3SDfnlVU" -> (known after apply)
        # (11 unchanged attributes hidden)
    }

  # aws_s3_object.origin_dist_artifact["index.html"] will be updated in-place
  ~ resource "aws_s3_object" "origin_dist_artifact" {
      ~ etag                   = "8676bbc67bd97392166276f4bff1f0f2" -> "81d5cc6cfe2b776f1f7badadd8c99ef8"
        id                     = "dist/index.html"
      ~ source_hash            = "8676bbc67bd97392166276f4bff1f0f2" -> "81d5cc6cfe2b776f1f7badadd8c99ef8"
        tags                   = {}
      ~ version_id             = "VGxofA7kT4kNNb_MAAm9GSVw1qVQHNcZ" -> (known after apply)
        # (11 unchanged attributes hidden)
    }

  # aws_s3_object.origin_dist_artifact["static/js/app.64c7b150.js"] will be created
+   resource "aws_s3_object" "origin_dist_artifact" {
+       acl                    = (known after apply)
+       arn                    = (known after apply)
+       bucket                 = "cpfreporter-origin-357150818708-us-west-2"
+       bucket_key_enabled     = (known after apply)
+       checksum_crc32         = (known after apply)
+       checksum_crc32c        = (known after apply)
+       checksum_sha1          = (known after apply)
+       checksum_sha256        = (known after apply)
+       content_type           = "text/javascript"
+       etag                   = "ebdb4e0926d6060b48f419788f722d93"
+       force_destroy          = false
+       id                     = (known after apply)
+       key                    = "dist/static/js/app.64c7b150.js"
+       kms_key_id             = (known after apply)
+       server_side_encryption = "AES256"
+       source                 = "/home/runner/work/cpf-reporter/cpf-reporter/web/dist/static/js/app.64c7b150.js"
+       source_hash            = "ebdb4e0926d6060b48f419788f722d93"
+       storage_class          = (known after apply)
+       tags_all               = {
+           "env"        = "staging"
+           "management" = "terraform"
+           "owner"      = "grants"
+           "repo"       = "cpf-reporter"
+           "service"    = "cpf-reporter"
+           "usage"      = "workload"
        }
+       version_id             = (known after apply)
    }

  # aws_s3_object.origin_dist_artifact["static/js/app.64c7b150.js.LICENSE.txt"] will be created
+   resource "aws_s3_object" "origin_dist_artifact" {
+       acl                    = (known after apply)
+       arn                    = (known after apply)
+       bucket                 = "cpfreporter-origin-357150818708-us-west-2"
+       bucket_key_enabled     = (known after apply)
+       checksum_crc32         = (known after apply)
+       checksum_crc32c        = (known after apply)
+       checksum_sha1          = (known after apply)
+       checksum_sha256        = (known after apply)
+       content_type           = "text/plain"
+       etag                   = "3b6b61b80017ed2a756a2cec1364fac3"
+       force_destroy          = false
+       id                     = (known after apply)
+       key                    = "dist/static/js/app.64c7b150.js.LICENSE.txt"
+       kms_key_id             = (known after apply)
+       server_side_encryption = "AES256"
+       source                 = "/home/runner/work/cpf-reporter/cpf-reporter/web/dist/static/js/app.64c7b150.js.LICENSE.txt"
+       source_hash            = "3b6b61b80017ed2a756a2cec1364fac3"
+       storage_class          = (known after apply)
+       tags_all               = {
+           "env"        = "staging"
+           "management" = "terraform"
+           "owner"      = "grants"
+           "repo"       = "cpf-reporter"
+           "service"    = "cpf-reporter"
+           "usage"      = "workload"
        }
+       version_id             = (known after apply)
    }

  # aws_s3_object.origin_dist_artifact["static/js/app.e9c295cb.js"] will be destroyed
  # (because key ["static/js/app.e9c295cb.js"] is not in for_each map)
-   resource "aws_s3_object" "origin_dist_artifact" {
-       arn                    = "arn:aws:s3:::cpfreporter-origin-357150818708-us-west-2/dist/static/js/app.e9c295cb.js" -> null
-       bucket                 = "cpfreporter-origin-357150818708-us-west-2" -> null
-       bucket_key_enabled     = false -> null
-       content_type           = "text/javascript" -> null
-       etag                   = "ee2d6dcf05fea623a2193397dce7bc2d" -> null
-       force_destroy          = false -> null
-       id                     = "dist/static/js/app.e9c295cb.js" -> null
-       key                    = "dist/static/js/app.e9c295cb.js" -> null
-       metadata               = {} -> null
-       server_side_encryption = "AES256" -> null
-       source                 = "/home/runner/work/cpf-reporter/cpf-reporter/web/dist/static/js/app.e9c295cb.js" -> null
-       source_hash            = "ee2d6dcf05fea623a2193397dce7bc2d" -> null
-       storage_class          = "STANDARD" -> null
-       tags                   = {} -> null
-       tags_all               = {
-           "env"        = "staging"
-           "management" = "terraform"
-           "owner"      = "grants"
-           "repo"       = "cpf-reporter"
-           "service"    = "cpf-reporter"
-           "usage"      = "workload"
        } -> null
-       version_id             = "0.8tqVeAvdMMo_7KqW_ZdMA1sngqPG3R" -> null
    }

  # aws_s3_object.origin_dist_artifact["static/js/app.e9c295cb.js.LICENSE.txt"] will be destroyed
  # (because key ["static/js/app.e9c295cb.js.LICENSE.txt"] is not in for_each map)
-   resource "aws_s3_object" "origin_dist_artifact" {
-       arn                    = "arn:aws:s3:::cpfreporter-origin-357150818708-us-west-2/dist/static/js/app.e9c295cb.js.LICENSE.txt" -> null
-       bucket                 = "cpfreporter-origin-357150818708-us-west-2" -> null
-       bucket_key_enabled     = false -> null
-       content_type           = "text/plain" -> null
-       etag                   = "3b6b61b80017ed2a756a2cec1364fac3" -> null
-       force_destroy          = false -> null
-       id                     = "dist/static/js/app.e9c295cb.js.LICENSE.txt" -> null
-       key                    = "dist/static/js/app.e9c295cb.js.LICENSE.txt" -> null
-       metadata               = {} -> null
-       server_side_encryption = "AES256" -> null
-       source                 = "/home/runner/work/cpf-reporter/cpf-reporter/web/dist/static/js/app.e9c295cb.js.LICENSE.txt" -> null
-       source_hash            = "3b6b61b80017ed2a756a2cec1364fac3" -> null
-       storage_class          = "STANDARD" -> null
-       tags                   = {} -> null
-       tags_all               = {
-           "env"        = "staging"
-           "management" = "terraform"
-           "owner"      = "grants"
-           "repo"       = "cpf-reporter"
-           "service"    = "cpf-reporter"
-           "usage"      = "workload"
        } -> null
-       version_id             = "_BVU.wStt_glbbX0w7ZTEWa9CNOUZ.T1" -> null
    }

  # aws_s3_object.website_deploy_config will be updated in-place
  ~ resource "aws_s3_object" "website_deploy_config" {
      ~ content                = <<-EOT
            window.APP_CONFIG = window.APP_CONFIG || {};
            window.APP_CONFIG.featureFlags = {};
-           window.APP_CONFIG.webConfigParams = {"auth_provider":"TBD","passage_app_id":"TBD"};
+           window.APP_CONFIG.webConfigParams = {"auth_provider":"local","passage_app_id":"TBD"};
            
            window.APP_CONFIG.overrideFeatureFlag = (flagName, overrideValue) => {
              const storageKey = 'featureFlags';
              let overrides = {};
              try {
                overrides = JSON.parse(window.sessionStorage.getItem(storageKey)) || {};
              } catch (e) {
                console.error(`Error parsing window.sessionStorage.${storageKey} as JSON:`, e);
                console.warn(`window.sessionStorage.${storageKey} will be replaced.`);
              }
              overrides[flagName] = overrideValue;
              window.sessionStorage.setItem(storageKey, JSON.stringify(overrides));
              console.log('New feature flag overrides in page session:',
                window.sessionStorage.getItem(storageKey));
            };
        EOT
      ~ etag                   = "538342baaa395a023fa41e70a8312e08" -> "8c4ef5653258733f2e26f03b47269a22"
        id                     = "config/deploy-config.js"
      ~ source_hash            = "538342baaa395a023fa41e70a8312e08" -> "8c4ef5653258733f2e26f03b47269a22"
        tags                   = {}
      ~ version_id             = "X7K7e3z6TvzeYF3b2cnCSCoa54jPrUQm" -> (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.lambda_function-cpfValidation.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "cpfreporter-cpfValidation"
      ~ last_modified                  = "2024-04-29T15:55:03.000+0000" -> (known after apply)
      ~ qualified_arn                  = "arn:aws:lambda:us-west-2:357150818708:function:cpfreporter-cpfValidation:87" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:us-west-2:lambda:path/2015-03-31/functions/arn:aws:lambda:us-west-2:357150818708:function:cpfreporter-cpfValidation:87/invocations" -> (known after apply)
      ~ s3_key                         = "python.b5970b3445417c305b7223364c478cbb.zip" -> "python.df5d642dfb16a6701056fdf5dc795624.zip"
        tags                           = {}
      ~ version                        = "87" -> (known after apply)
        # (19 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              ~ "DD_COMMIT_SHA"                = "842849173420fa4fb2598339ea7cbc9984ce9b96" -> "346cd3fd74e7694c8a4538f1ecc8f75ee734d8a8"
              ~ "DD_TAGS"                      = "git.commit.sha:842849173420fa4fb2598339ea7cbc9984ce9b96,git.repository_url:github.com/usdigitalresponse/cpf-reporter" -> "git.commit.sha:346cd3fd74e7694c8a4538f1ecc8f75ee734d8a8,git.repository_url:github.com/usdigitalresponse/cpf-reporter"
              ~ "DD_VERSION"                   = "842849173420fa4fb2598339ea7cbc9984ce9b96" -> "346cd3fd74e7694c8a4538f1ecc8f75ee734d8a8"
                # (14 unchanged elements hidden)
            }
        }

        # (4 unchanged blocks hidden)
    }

  # module.lambda_function-cpfValidation.aws_lambda_permission.current_version_triggers["S3BucketNotification"] must be replaced
-/+ resource "aws_lambda_permission" "current_version_triggers" {
      ~ id                  = "S3BucketNotification" -> (known after apply)
      ~ qualifier           = "87" # forces replacement -> (known after apply) # forces replacement
+       statement_id_prefix = (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.lambda_function-graphql.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "cpfreporter-graphql"
      ~ qualified_arn                  = "arn:aws:lambda:us-west-2:357150818708:function:cpfreporter-graphql:135" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:us-west-2:lambda:path/2015-03-31/functions/arn:aws:lambda:us-west-2:357150818708:function:cpfreporter-graphql:135/invocations" -> (known after apply)
        tags                           = {}
      ~ version                        = "135" -> (known after apply)
        # (21 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
+               "AUTH_PROVIDER"                      = "local"
              ~ "DD_COMMIT_SHA"                      = "842849173420fa4fb2598339ea7cbc9984ce9b96" -> "346cd3fd74e7694c8a4538f1ecc8f75ee734d8a8"
              ~ "DD_TAGS"                            = "git.commit.sha:842849173420fa4fb2598339ea7cbc9984ce9b96,git.repository_url:github.com/usdigitalresponse/cpf-reporter" -> "git.commit.sha:346cd3fd74e7694c8a4538f1ecc8f75ee734d8a8,git.repository_url:github.com/usdigitalresponse/cpf-reporter"
              ~ "DD_VERSION"                         = "842849173420fa4fb2598339ea7cbc9984ce9b96" -> "346cd3fd74e7694c8a4538f1ecc8f75ee734d8a8"
                # (17 unchanged elements hidden)
            }
        }

        # (5 unchanged blocks hidden)
    }

  # module.lambda_function-graphql.aws_lambda_permission.current_version_triggers["APIGateway"] must be replaced
-/+ resource "aws_lambda_permission" "current_version_triggers" {
      ~ id                  = "APIGateway" -> (known after apply)
      ~ qualifier           = "135" # forces replacement -> (known after apply) # forces replacement
+       statement_id_prefix = (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.lambda_function-processValidationJson.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "cpfreporter-processValidationJson"
      ~ qualified_arn                  = "arn:aws:lambda:us-west-2:357150818708:function:cpfreporter-processValidationJson:43" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:us-west-2:lambda:path/2015-03-31/functions/arn:aws:lambda:us-west-2:357150818708:function:cpfreporter-processValidationJson:43/invocations" -> (known after apply)
        tags                           = {}
      ~ version                        = "43" -> (known after apply)
        # (21 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              ~ "DD_COMMIT_SHA"                      = "842849173420fa4fb2598339ea7cbc9984ce9b96" -> "346cd3fd74e7694c8a4538f1ecc8f75ee734d8a8"
              ~ "DD_TAGS"                            = "git.commit.sha:842849173420fa4fb2598339ea7cbc9984ce9b96,git.repository_url:github.com/usdigitalresponse/cpf-reporter" -> "git.commit.sha:346cd3fd74e7694c8a4538f1ecc8f75ee734d8a8,git.repository_url:github.com/usdigitalresponse/cpf-reporter"
              ~ "DD_VERSION"                         = "842849173420fa4fb2598339ea7cbc9984ce9b96" -> "346cd3fd74e7694c8a4538f1ecc8f75ee734d8a8"
                # (16 unchanged elements hidden)
            }
        }

        # (5 unchanged blocks hidden)
    }

  # module.lambda_function-processValidationJson.aws_lambda_permission.current_version_triggers["S3BucketNotification"] must be replaced
-/+ resource "aws_lambda_permission" "current_version_triggers" {
      ~ id                  = "S3BucketNotification" -> (known after apply)
      ~ qualifier           = "43" # forces replacement -> (known after apply) # forces replacement
+       statement_id_prefix = (known after apply)
        # (5 unchanged attributes hidden)
    }

Plan: 7 to add, 11 to change, 7 to destroy.
```

</details>

*Pusher: @as1729, Action: `pull_request_target`, Workflow: [`Continuous Integration`](https://github.com/usdigitalresponse/cpf-reporter/actions/runs/8884853887)*